{
  "id": "292052661",
  "title": "Python Girona juny'23-Convierte Jupyter notebooks en código mantenible con Kedro",
  "eventUrl": "https://www.meetup.com/pythongirona/events/292052661",
  "description": "Bones Pythonistes!\n\nEn aquesta sessió tenim un convidat molt especial! [@astrojuanlu](https://github.com/astrojuanlu) ens torna a visitar! 😍\n\nL'esdeveniment serà el **dimarts 13 de juny a les 19h al Centre Cultural de la Mercè, Girona.**\n\n🍕 Després anirem a sopar al centre de Girona.\n\n**Ponent**\nJuan Luis Cano [@astrojuanlu](https://github.com/astrojuanlu) vindrà expressament des de Madrid per parlar-nos de Kedro.\n\nÉs soci fundador i ex-president de Python España, escriu el noticiari setmanal sobre Python Científic, desenvolupa la biblioteca poliastro per astrodinàmica interactiva, i col·labora amb diferents projectes de l'ecosistema PyData. Lidera el grup PyData Madrid i està molt posat en l'escena científic-tecnològica de la península.\n\n**Xerrada - Convierte tus notebooks de Jupyter en código mantenible con Kedro**\n\nLos notebooks de Jupyter son excelentes para exploración, visualización, y en definitiva: la “ciencia” en “ciencia de datos”. Pero cuando los notebooks empiezan a crecer en complejidad, surgen problemas - y además, colaborar sobre ellos no es fácil. ¿No sería genial que existiese una solución?\nLos notebooks han sido fundamentales para el surgimiento de la ciencia de datos como campo, ya que brindan una interfaz fácil de usar, ofrecen un feedback rápido, y constituyen tanto un entorno de desarrollo como un formato de intercambio. Sin embargo, también se reconoce ampliamente que a menudo plantean problemas de reproducibilidad y mantenibilidad: el 90 % de los notebooks de Jupyter publicados no indican explícitamente las dependencias de los paquetes (Wang et al, 2021), y el 96 % de ellos contener errores o estado oculto que impidió obtener los mismos resultados después de volver a ejecutar (Pimentel et al, 2019).\nSe han propuesto varias herramientas y enfoques para mitigar los problemas de los notebooks para datos de producción. ciencia. En este taller, los autores proponen un flujo de trabajo que consiste en la refactorización iterativa de notebooks de Jupyter: mediante la extracción incremental de referencias de datos y lógica de negocio en módulos reutilizables de Python, los participantes serán capaces de explotar las capacidades dinámicas de los notebooks manteniendo su complejidad bajo control. Estos módulos de Python harán uso de Kedro, un framework Python para crear tuberías de datos reproducibles, mantenibles y modulares.\n\nEl contenido es el siguiente:\n⬥ Introducción ⬥ ¿Qué es Kedro? ⬥ Usando Kedro desde Jupyter ⬥ Creando tu catálogo de datos ⬥ Convirtiendo tu notebook en una biblioteca Python reutilizable ⬥ Creando tus primeras tuberías de Kedro ⬥ Visualizando tu flujo de datos con Kedro Viz",
  "shortDescription": null,
  "group": {
    "id": "20691695",
    "name": "Python Girona"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27292681",
    "name": "Centre Cultural de la Mercè",
    "address": "Pujada de la Mercè, 12",
    "city": "Girona",
    "postalCode": "17004",
    "lng": 2.82519,
    "lat": 41.981735
  },
  "onlineVenue": null,
  "dateTime": "2023-06-13T19:00+02:00",
  "duration": "PT1H30M",
  "timezone": "Europe/Madrid",
  "endTime": "2023-06-13T20:30+02:00"
}