{
  "id": "301297291",
  "title": "Python Meetup June: Pyments and OpenPyXL",
  "eventUrl": "https://www.meetup.com/python-barcelona/events/301297291",
  "description": "For the month of june, we have two amazing talks about **Online Payments** and **OpenPYXL**!\n\\-\\-\\-\nSchedule:\n\n* 👋 18:30: Hi!\n* 🗣️ 19:00: Talks!\n* 🍕 **&** 🍻 20:00: Networking, food and drinks!\n* 👋 21:00: Bye!\n\n\\-\\-\\-\n\n* ➡️ **What:** Pyments: How To Design Payment Applications In Python\n* 📢 **Who**: Alvaro Duran\n* ⏱ **Duration**: 30 minutes\n* 👅 **Language**: English\n* 🧐 **Abstract**: \"Payments are a massive part of how the world works. But most engineers know very little about it. That’s sad, because, as more and more of business happens online, there’s an increasing demand for payment applications that are scalable, and maintainable. Besides, Python is a great programming language to build payment applications! It is very interoperable, has a thriving open source community, and even non-engineers can contribute significantly to software built with it. In payments, readability counts, too!\nIn this talk, we’re going to dive deep into how to build money software effectively. You’ll learn why Python and payments are a match made in heaven, and how to leverage the language to build your own payment applications, in-house, fast, and effectively. That way, you’ll cut some intermediaries in the process, saving your company a lot of money. It is no wonder why software engineers that can build payment applications are in high demand, they can point to their code and say “that prints money”.\"\n\n\\-\\-\\-\\-\n\n* ➡️ **What:** Mastering Excel Automation with OpenPYXL\n* 📢 **Who**:Jordi Bosch\n* ⏱ **Duration**: 30 minutes\n* 👅 **Language**: Spanish\n* 🧐 **Abstract**: Tired about complex VBA macros and functions? Join the Excel revolution as we see how OpenPYXL Python library changes how we work with spreadsheets. We'll discover how to handle data with a touch of Python magic.\nBy the end, you’ll be an Excel expert, easily automating tasks and managing complex data with a few clicks. Get ready to improve your data skills!\n\n\\-\\-\\-\\-\n➡️ Location:\n\\- Gartner \\- Hexagon Building\\, Àlaba\\, 121\\, 08018 Barcelona\n\n\\-\\-\\-\\-\n➡️ Access Control\n\n* 🛂 The security access control requires an **attendee list** (full name) and a **means of identification** (DNI, NIE, passport)\n* ⚠️ Make sure you register for the event with your **full name** and **ID**. Otherwise, you will be REMOVED from the attendance list.\n* 🪪 You’ll be asked to provide that ID to access the building.\n* 🚸 People under 18 years old shall be accompanied by a legal guardian\n\n\\-\\-\\-\\-\n➡️ Only register if you can attend!\n\n* 🪑 There are limited seats, so please be responsible when signing up\n* 🚷 If you can't make it, please free up your seat, so someone else can attend. We keep a list with repeated offenders!\n\n\\-\\-\\-\\-\n➡️ More at [PyBCN.org](https://pybcn.org/)\n\n* 📢 We need talk proposals! [Send yours](https://pybcn.org/pybcn_association/propose-a-talk/)\n* 🦄 Want to [publish a job offer](https://pybcn.org/job-offers)?\n* 🐦 Follow [@PyBCN](https://twitter.com/pybcn) for pictures, slides, videos and more",
  "shortDescription": null,
  "group": {
    "id": "831283",
    "name": "Python Barcelona Meetup"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27688171",
    "name": "Gartner - Center of Excellence",
    "address": "C/ de Sancho de Ávila, 47",
    "city": "Barcelona",
    "postalCode": "08018",
    "lng": 2.189932,
    "lat": 41.398815
  },
  "onlineVenue": null,
  "dateTime": "2024-06-13T18:30+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-06-13T20:30+02:00"
}