{
  "id": "293874558",
  "title": "PyBirras Coruña Setembro 2023",
  "eventUrl": "https://www.meetup.com/python-a-coruna/events/293874558",
  "description": "Volvemos de vacaciones de verano y lo hacemos a lo grande con una charla patrocinada por la gente de [YepCode](https://yepcode.io/) .\n\nNos harán una pequeña introducción de su herramienta y nos mostrarán con un par de casos de uso prácticos (uno de ellos usando la API de OpenAI que está tan de moda últimamente) lo útil que puede ser tanto para desarrolladores que están dando sus primeros pasos como para gente con más experiencia.\n\nTambién nos invitarán a unos pinchos y bebidas durante la charla, para lo que es muy importante que estéis apuntados en este evento para poder llevar un control de la gente que realmente viene a nuestro evento y diferenciarlos de los otros clientes que tenga el bar.\n\nTambién sortearemos un par de licencias anuales que nos cede la gente de [JetBrains](https://www.jetbrains.com/) para que podáis usar cualquiera de sus productos (preferentemente PyCharm, que para eso el grupo es sobre Python).\n\nPor último, pero no por ello menos importante, sortearemos dos entradas para la [Atlántica Conf 2023](https://atlanticaconf.com/) que se celebrará los días 22 y 23 de septiembre en la Facultad de Informática de Coruña.\n\nPara cualquier detalle adicional sobre el evento podéis consultarnos por cualquiera de los métodos listados en nuestro [Linktree](https://linktr.ee/pythoncoruna).",
  "shortDescription": null,
  "group": {
    "id": "36742904",
    "name": "Python A Coruña"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27561952",
    "name": "Ateneo",
    "address": "Rúa Reverendo Padre José Álvarez Cabezas, 1",
    "city": "A Coruña",
    "postalCode": "15011",
    "lng": -8.417,
    "lat": 43.369785
  },
  "onlineVenue": null,
  "dateTime": "2023-09-16T18:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-09-16T20:00+02:00"
}