{
  "id": "304023272",
  "title": "HacktoberfestES Python Coruña 2024",
  "eventUrl": "https://www.meetup.com/python-a-coruna/events/304023272",
  "description": "¿Qué es el Hacktoberfest? 🎉\nEl Hacktoberfest es un evento anual colaborativo, dedicado a promover el código abierto, pero ¡ojo! ⚠️, que no tiene nada que ver con hackers o piratas informáticos 🏴‍☠️. Aquí no venimos a romper sistemas, sino a construirlos. 🛠️ La idea es sencilla: contribuir a proyectos de software libre y hacer que la tecnología sea más accesible para todos. 🌍\n\nLa versión española, HacktoberfestES, le da un toque especial a este evento global 🌐, adaptándolo a la comunidad hispanohablante 🇪🇸. Hemos seleccionado proyectos interesantes, organizado actividades, y creado un espacio donde puedes aprender, colaborar, y hasta hacer algún que otro amigo en el camino. 🤝\n\n¿Quién puede participar?\nCualquiera con ganas de participar. No importa si eres un experto o si solo has escrito tu primer \"Hello World\", todo el mundo es bienvenido. 👩‍💻👨‍💻 Tenemos retos y proyectos adaptados a distintos niveles de dificultad, así que tanto si buscas un desafío avanzado como si prefieres algo más sencillo para empezar, ¡lo tenemos cubierto! Aquí lo importante es sumar y pasarlo bien. 🎈\n\nY si no te apetece participar... ¡también puedes pasarte a curiosear! 👀 Conocer a las dos comunidades y enterarte de los futuros eventos y oportunidades. ¡Todo el mundo tiene algo que aportar, incluso si solo vienes a socializar! 💬\n\n¿Quién organiza el Hacktoberfest en A Coruña?\nEste evento nace de una colaboración entre dos comunidades coruñesas tech:\n\n\\- Python España 🐍🇪🇸 Es la asociación nacional de las comunidades locales del lenguaje de programación Python\\, que da apoyo legal y financiero mediante sus cuotas de socio y organiza el evento nacional más importante de Python: la PyConES\\.\n\n\\- Python Coruña 🐍🌊 es la comunidad local para los amantes del lenguaje de programación Python\\. Organizan de todo: charlas\\, talleres\\, meetups… y siempre con un ambiente inclusivo y de colegueo\\.\n\n\\- Google Developer Group A Coruña \\(GDG A Coruña\\) 🌐 forma parte de la red mundial de grupos apoyados por Google\\, y su objetivo es compartir conocimientos sobre las tecnologías de Google \\(y otras\\)\\, creando una red de apoyo entre los devs locales\\.\n\n\\- Grupo de Programadores y Usuarios de Linux \\(GPUL\\): Comunidad de software libre \\(en especial o Sistema Operativo Linux en todas sus variantes libres\\)\\, hardware libre y promoción del conocimiento\\.\n\nJuntos, hacen del Hacktoberfest un eventazo donde no solo vas a aprender, sino también a pasarlo bien, conocer gente con tus mismas inquietudes tecnológicas y comer mucha pizza. 🍕\n\nSi tienes alguna preferencia o alergia alimenticia, por favor, rellena este formulario:\nhttps://dub.sh/hacktoberfest-2024\n\nPrograma del evento\n\\| Hora \\| Actividad \\|\n\\|\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\|\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\|\n\\| 10:00\\-10:30 \\| Charla introductoria \\|\n\\| 10:30\\-11:00 \\| Explicación de los proyectos propuestos \\|\n\\| 11:00\\-12:00 \\| Coffee Break \\(porque sin café no se programa\\) ☕️ \\|\n\\| 12:00\\-14:00 \\| Realización de proyectos propuestos \\|\n\\| 14:00\\-16:00 \\| Comida \\(¡recarga de energías\\!\\) 🍽️ \\|\n\\| 16:00\\-18:00 \\| Realización de proyectos propuestos \\|\n\\| 18:00\\-19:00 \\| Coffee break \\(venga\\, otro cafecito más\\) ☕️ \\|\n\\| 19:00\\-20:30 \\| Realización de proyectos propuestos \\|\n\\| 20:30\\-21:00 \\| Despedida y cierre del evento \\|\n\nAsí que ya sabes, si tienes ganas de colaborar, aprender algo nuevo o simplemente curiosear, ¡este es tu sitio! 🌟 Para cualquier duda o comentario, pásate por nuestras redes sociales: linktr.ee/pythoncoruna y gdg.community.dev/gdg-a-coruna/. ¡Nos vemos en el Hacktoberfest! 👋",
  "shortDescription": null,
  "group": {
    "id": "36742904",
    "name": "Python A Coruña"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27905744",
    "name": "Centro Universitario Riazor",
    "address": "Rúa Almirante Lángara s/n,",
    "city": "A Coruña",
    "postalCode": "meetup18",
    "lng": -8.419907,
    "lat": 43.369465
  },
  "onlineVenue": null,
  "dateTime": "2024-10-26T10:00+02:00",
  "duration": "PT11H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-10-26T21:00+02:00"
}