{
  "id": "297536739",
  "title": "Vamos a explorar IA con AutoGen",
  "eventUrl": "https://www.meetup.com/python-sevilla/events/297536739",
  "description": "¡Traigan sus laptops y exploremos cómo desarrollar aplicaciones de Inteligencia Artifical multi-agente!\n\nEste taller se organiza de forma conjunta con el grupo [IA Generativa Sevilla](https://www.meetup.com/es-ES/ia-generativa-sevilla/).\n\nEn este taller exploraremos [AutoGen](https://github.com/microsoft/autogen/); un framework para construir aplicaciones alrededor de múltiples agentes de IA. Esto les permite resolver problemas complejos teniendo varios agentes trabajando juntos.\n\nDaremos un repaso muy breve del framework y sus componentes clave, pero la gran mayoría del tiempo será dedicada para que cada uno lo pruebe y vea lo que puede obtener de él.\n\nPrepararemos algunos ejemplos para usar como punto de partida, y traigan algunas ideas sobre cosas que pueden intentar construir, ¡pero realmente depende de ustedes! ¡Vengan con curiosidad y entusiasmo y aprendamos a construir cosas geniales juntos!\n\n**Requisitos:**\n\n* Trae tu portátil. Es un taller práctico, así que es necesario para participar en el taller.\n* Es interesante tener una clave de OpenIA API. Puedes generar la tuya siguiendo este documento: https://help.openai.com/en/articles/4936850-where-do-i-find-my-api-key\n\nTe esperamos en las oficinas de CARTO en Sevilla\n\nLas plazas son muy limitadas, así que, os rogamos que si por algún motivo no pueden asistir, dejen libre su reserva para que otra persona pueda asistir.",
  "shortDescription": null,
  "group": {
    "id": "18959885",
    "name": "Python Sevilla"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27706404",
    "name": "Carto",
    "address": "C. Ebro, 1",
    "city": "Sevilla",
    "postalCode": "41012",
    "lng": -5.982989,
    "lat": 37.35537
  },
  "onlineVenue": null,
  "dateTime": "2023-12-12T19:00+01:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-12-12T21:00+01:00"
}