{
  "id": "303334284",
  "title": "PyBirras Septiembre 2024",
  "eventUrl": "https://www.meetup.com/python-sevilla/events/303334284",
  "description": "Aprovechamos que la calor nos da un poco de tregua para volver a vernos las caras.\n\nEn el canal de Telegram hemos hablado sobre la posibilidad de proponer a la Asociación de Python España que la PyConEs 2025 se celebre en nuestra ciudad.\n\nAntes de liarnos la manta en la cabeza nos gustaría saber cuantos estaríais dispuesto a ayudar, un evento de este tipo necesita ayuda de muchos tipos de perfiles y durante periodos de tiempo muy diferentes, así que queremos hablar con vosotros para que entendáis lo que implica y en que grado podéis ayudar. No hace falta experiencia previa y hay diferentes tipos de trabajo para cada uno.\n\nTodas las personas están invitadas a acercarse y participar tanto si eres especialista en Python, una persona recién llegada a la comunidad o si no has tenido ningún contacto con ella anteriormente.\n\nOs esperamos en Corral de Esquivel, Alameda de Hércules, 38 Sevilla\n\nTenemos un [código de conducta](https://github.com/python-sevilla/meetups/blob/code_of_conduct/code_of_conduct.md) y aprovechamos para recordar, que todos las personas que asistan a los eventos de Python Sevilla deben aceptarlo y respetarlo durante todas las actividades y comunicaciones relacionadas con el grupo.\n\nPara más información podéis contactar con nosotros por Telegram en el canal https://t.me/pythonsevilla",
  "shortDescription": null,
  "group": {
    "id": "18959885",
    "name": "Python Sevilla"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27123395",
    "name": "Corral de Esquivel",
    "address": "Alameda de Hércules, 38",
    "city": "Sevilla",
    "postalCode": "41002",
    "lng": -5.994058,
    "lat": 37.399857
  },
  "onlineVenue": null,
  "dateTime": "2024-09-20T18:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-09-20T20:00+02:00"
}