{
  "id": "296383752",
  "title": "Inteligencia Artificial en la palma de tu mano con Hugging Face y Kedro",
  "eventUrl": "https://www.meetup.com/pydata-salamanca/events/296383752",
  "description": "**¡Reiniciamos PyData Salamanca!**\nEl próximo 📅 Martes 3 de Octubre de este 2023 estaremos de vuelta y nos traemos a Juan Luis Cano para que nos presente Kedro.\nTambién explicaremos los planes a futuro que se harán en los próximos meses para incentivar el desarrollo del mundo de los datos como parte del grupo.\n\n**#PyBeers**\nTras la charla se propondrá un lugar para que nos juntemos y charlemos un rato, para que podamos conocernos un poco y compartir experiencias.\n\n**📢 ¡Buscamos voluntarios!**\nSi te apasiona (o buscas que te apasione) el mundo de los datos, envíanos un correo a pydata[at]dani-pi[dot]com para atenderos. Buscamos colaboradores y divulgadores 😄\n\n**Resumen de la presentación**\n\"\"\"\nLa 'Inteligencia Artificial' está de moda, en gran parte gracias a sistemas generativos como ChatGPT, Midjourney, y similares. Estos sistemas comerciales son muy sofisticados y potentes, pero también un poco opacos si lo que quieres es aprender cómo funcionan o adaptarlos a tus necesidades. ¿Qué ocurre dentro de la 'caja negra'?\n\nPor suerte existen modelos de 'Inteligencia Artificial' abiertos y que puedes descargar cómodamente, estudiar sin restricciones, y ajustar para que hagan lo que tú quieres. Esto requiere de ciertos conocimientos técnicos, pero gracias a los modelos de Hugging Face, sus bibliotecas de Python extremadamente sencillas, y el catálogo y los pipelines de Kedro, adentrarse en la 'Inteligencia Artificial' es más fácil que nunca.\n\nEn esta charla contaremos qué es Kedro, cómo podemos utilizar su catálogo dinámico para descargar modelos y datasets de Hugging Face, y haremos una pequeña demo.\n\"\"\"",
  "shortDescription": null,
  "group": {
    "id": "30890235",
    "name": "PyData Salamanca"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "26066043",
    "name": "Edificio Multiusos I+D+i Universidad de Salamanca",
    "address": "C. Espejo, 2",
    "city": "Salamanca",
    "postalCode": "37007",
    "lng": -5.671127,
    "lat": 40.965298
  },
  "onlineVenue": null,
  "dateTime": "2023-10-03T17:30+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-10-03T19:30+02:00"
}