{
  "id": "300567555",
  "title": "Polars, bearing DataFrame manipulation",
  "eventUrl": "https://www.meetup.com/pydata-salamanca/events/300567555",
  "description": "**¡Volvemos con PyData Salamanca!**\nEl próximo 📅 Martes 30 de Abril de este 2024 estaremos de vuelta y nos traemos a Alberto Ando para que nos presente Polars.\n\n**#PyBeers**\nTras la charla se propondrá un lugar para que nos juntemos y charlemos un rato, para que podamos conocernos un poco y compartir experiencias.\n\n**📢 ¡Buscamos voluntarios!**\nSi te apasiona (o buscas que te apasione) el mundo de los datos, envíanos un correo a pydata[at]dani-pi[dot]com para atenderos. Buscamos colaboradores y divulgadores 😄. Anímate a presentar algo a la comunidad!\n\n**Resumen de la presentación**\n\"\"\"\nAl trabajar en la manipulación de datos con DataFrames, encontramos diferentes retos. Estos retos van cambiando según el tipo de datos y más importante, según el tamaño de nuestros datos. A medida que nuestros conjuntos de datos crecen, también lo hacen los obstáculos. Datos más grandes conllevan operaciones que consumen tiempo y procesos que devoran la memoria, ralentizando nuestro flujo de trabajo y obstaculizando la productividad.\n\nMedidas comúnmente utilizadas como Pandas no son soluciones viables para este tipo de escenarios, y por tanto tenemos que hacer uso de otras herramientas. En esta charla veremos qué es Polars, una librería basada en Rust, y como nos permite lidiar con varios de los problemas vistos.\n\nÚnete a nosotros para entender una nueva forma de lidiar con los datos más rápida y optimizando el uso de memoria, de una forma simple y familiar, que transformará tu flujos de trabajo con datos.\n\"\"\"",
  "shortDescription": null,
  "group": {
    "id": "30890235",
    "name": "PyData Salamanca"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "26066043",
    "name": "Edificio Multiusos I+D+i Universidad de Salamanca",
    "address": "C. Espejo, 2",
    "city": "Salamanca",
    "postalCode": "37007",
    "lng": -5.671127,
    "lat": 40.965298
  },
  "onlineVenue": null,
  "dateTime": "2024-04-30T19:00+02:00",
  "duration": "PT1H30M",
  "timezone": "Europe/Madrid",
  "endTime": "2024-04-30T20:30+02:00"
}