{
  "id": "293515307",
  "title": "Microservices with Serverless resources in AWS, a practical approach",
  "eventUrl": "https://www.meetup.com/python_malaga/events/293515307",
  "description": "Join the speaker as he shares his journey of creating microservice architectures in AWS, from scratch! Learn how he built AWS Monitron, a new service that leverages API Gateway and AWS Lambda functions to deliver scalable and reliable solutions for AWS customers. Discover how to use Clouformation to define your infrastructure, and how to deploy your code seamlessly through a CI/CD pipeline in AWS. Plus, get tips on how to debug your Lambda code locally using Docker. Don't miss this opportunity to gain practical insights and skills on microservice architectures in AWS!\n\n\\-\\-\\-\\-\\-\nÚnete al ponente mientras comparte su viaje de creación de arquitecturas de microservicios en AWS, ¡desde cero! Descubre cómo crea AWS Monitron, un nuevo servicio que aprovecha las funciones API Gateway y AWS Lambda para ofrecer soluciones escalables y confiables para los clientes de AWS. Descubre cómo usar Clouformation para definir su infraestructura y cómo implementar su código sin problemas a través de un pipeline de CI/CD en AWS. Además, aprende sobre cómo depurar tu código Lambda localmente con Docker. ¡No te pierdas esta oportunidad de obtener conocimientos prácticos y habilidades sobre arquitecturas de microservicios en AWS!\n\nEsta charla tendrá lugar dentro del evento opensouthcode de málaga\nhttps://www.opensouthcode.org/conferences/opensouthcode2023",
  "shortDescription": null,
  "group": {
    "id": "33344430",
    "name": "Python Málaga"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "26178960",
    "name": "La Térmica",
    "address": "Av. de los Guindos, 48",
    "city": "Málaga",
    "postalCode": "29004",
    "lng": -4.445437,
    "lat": 36.68937
  },
  "onlineVenue": null,
  "dateTime": "2023-06-09T17:30+02:00",
  "duration": "PT1H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-06-09T18:30+02:00"
}