{
  "id": "302975941",
  "title": "Ciberseguridad e Inteligencia Artificial",
  "eventUrl": "https://www.meetup.com/pydata-eivissa-ibiza/events/302975941",
  "description": "¡Nos complace anunciar el segundo evento de PyData en Ibiza en septiembre!\n\nEl evento se realizará en la UIB (antiguo edificio de la Comandancia, carrer del Calvari, 1).\n\nModerarán el evento Javier Marín Tur y César Ruiz Gorrochategui, organizadores principales de PyData Eivissa, y contaremos con cuatro charlas:\n\n* **Alberto Martín de los Santos** y **Javi Torner Riaza** (19:00-19:30), director de Ciberseguridad y coordinador SOC en Inetum, arrancarán con sendas ponencias \"Concienciación en ciberseguridad: impacto de un ciberataque\" y \"Protegiendo el Futuro Digital: El Día a Día de un Analista de Ciberseguridad\".\n* **Marta Gómez Macías** (19:30-20:00), ingeniera de software en VirusTotal, impartirá la ponencia \"Ciberamenazas dirigidas a analistas de datos y programadores Python\".\n* **Pau Rodríguez López** (19:45-20:10), research scientist en Apple, nos hablará sobre mitigación de toxicidad en modelos de lenguaje.\n\nEl cierre correrá a cargo de Toni Marí Ribas, Jefe de estudios FP, IES Sa Colomina.\n\nDespués de las charlas, ofreceremos bebidas y picoteo patrocinados en el mismo lugar para continuar con el networking.\n\nEl evento cuenta con el apoyo del Ayuntamiento de Ibiza, el Consell de Ibiza y la Cámara de Comercio, así como de la organización sin ánimo de lucro NumFOCUS.",
  "shortDescription": null,
  "group": {
    "id": "36715005",
    "name": "PyData Eivissa/Ibiza"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27218459",
    "name": "Sede Uib ",
    "address": "Carrer del calvari 1. Antiguo edificio de La Comandancia.",
    "city": "Ibiza",
    "postalCode": "meetup645",
    "lng": 1.432948,
    "lat": 38.90589
  },
  "onlineVenue": null,
  "dateTime": "2024-09-12T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-09-12T21:00+02:00"
}