{
  "id": "293993243",
  "title": "Web Scrapping con Python",
  "eventUrl": "https://www.meetup.com/python-valencia-meetup/events/293993243",
  "description": "\\#\\# Charla\n\nTodas las páginas web están construidas con código HTML. El Web Scrapping lo que hace como técnica es obtener el código HTML de la página web de la que queremos extraer la información y procesar dicho contenido para extraer del mismo únicamente los apartados que nos interesen y de una forma lo más automatizada posible. Pero el Scrapping no siempre es fácil, hay toda una plétora de problemas con los que nos podemos encontrar cuando intentamos extraer la información de una página web. Información que está detrás de un login, webs que se renderizan mediante javascript o APIs que intentan impedir que las consumas son algunos de los problemas con los que nos encontramos frecuentemente. En mi trabajo como programador, he pasado gran cantidad de mi tiempo de trabajo scrappeando información. En esta charla, compartiré todas las lecciones aprendidas de mi día a día scrappeando información.\n\n\\#\\# Ponente: David Hernández\n\nDespués de trabajar en varias empresas nacionales e internacionales, decidí dar un giro a mi carrera profesional y he dedicado los últimos dos años y medio a trabajar para una ONG, haciendo seguimiento parlamentario y proyectos de transparencia. Ahora, después de cerrar esta etapa, estoy montando un equipo de desarrollo junto con unos compañeros, centrado en el desarrollo y la automatización de procesos.",
  "shortDescription": null,
  "group": {
    "id": "16514622",
    "name": "Python Valencia"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27591803",
    "name": "wayCO Cabanyal | Coworking València",
    "address": "Carrer de Marià Cuber, 17",
    "city": "València",
    "postalCode": "46011",
    "lng": 0,
    "lat": 0
  },
  "onlineVenue": null,
  "dateTime": "2023-07-27T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-07-27T21:00+02:00"
}