{
  "id": "297136322",
  "title": "Principios básicos para hacer un buen diseño de visualización de datos",
  "eventUrl": "https://www.meetup.com/python-valencia-meetup/events/297136322",
  "description": "A caballo entre el diseño, el desarrollo web y de aplicaciones, el periodismo o la investigación científica, se encuentra la visualización de datos, una especialización que desde el 2010 no deja de crecer y que en estos últimos años ha acelerado su presencia y crecimiento gracias a la aparición de herramientas interactivas, la evolución de la velocidad del procesamiento de datos y la evolución de la inteligencia artificial.\n\nAdemás, la importancia de afrontar un buen diseño en la visualización de datos cobra cada vez con mayor importancia en la realización de cuadros de mando para herramientas de análisis o en diseños de cualquier interfaz de usuario sea tanto para escritorio, móvil o web.\n\nUna oportunidad para adentrarse en el mundo de las visualizaciones y descubrir cuál es su potencial informativo y su importancia tanto para grandes corporaciones como en pequeñas empresas.\n\n\\#\\# Trayectoria laboral\n\nMaría Usán Porta cuenta con más de 15 años de experiencia como diseñadora gráfica y de producto. Tras unos inicios en el mundo del diseño gráfico y editorial en varias editoriales y empresas de publicidad, se especializó en diseño web y marketing digital para adentrarse finalmente en el mundo del diseño de producto trabajando en experiencia de usuario y diseño de interfaces (UX / UI), actividad que desempeña plenamente desde 2019 como freelance.\n\nActualmente compagina su actividad como directora creativa y diseñadora de producto en Sapps Studio con la de docencia en Idecrea - escuela de diseño y creación digital y VIU (Universidad Internacional de Valencia).",
  "shortDescription": null,
  "group": {
    "id": "16514622",
    "name": "Python Valencia"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27591803",
    "name": "wayCO Cabanyal | Coworking València",
    "address": "Carrer de Marià Cuber, 17",
    "city": "València",
    "postalCode": "46011",
    "lng": -0.334373,
    "lat": 39.464138
  },
  "onlineVenue": null,
  "dateTime": "2023-11-30T18:30+01:00",
  "duration": "PT1H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-11-30T19:30+01:00"
}