{
  "id": "294116744",
  "title": "Autodeployment de aplicaciones Python en Kubernetes",
  "eventUrl": "https://www.meetup.com/python-valencia-meetup/events/294116744",
  "description": "\\#\\# Charla\n\nEn esta charla, exploraremos cómo optimizar el despliegue de aplicaciones Python en Kubernetes a través de la automatización. Comenzaremos discutiendo la importancia del autodeployment en la eficiencia de los equipos de desarrollo y proporcionaremos una visión general de los conceptos de integración continua y despliegue continuo (CI/CD). Pasaremos a explicar cómo configurar un pipeline de CI/CD con GitLab para una aplicación Python, que incluirá la construcción de la aplicación y su despliegue en un entorno Kubernetes. Además, mostraremos cómo manejar diferentes entornos como staging y producción. Nuestro foco principal será la configuración de Kubernetes, donde explicaremos cómo definir y aplicar los recursos necesarios, como despliegues y servicios, para nuestra aplicación. Para concluir, introduciremos Helm, un gestor de paquetes para Kubernetes, que puede simplificar aún más el despliegue de nuestra aplicación. A lo largo de la charla, proporcionaremos fragmentos de código y demostraremos su funcionamiento. Esta presentación está diseñada para aquellos con un conocimiento básico de Python, Docker, Kubernetes y GitLab que estén buscando mejorar su flujo de trabajo de despliegue\n\n\\#\\# Ponente: Antony R\\. Goetzschel\n\nComo Administrador de Sistemas por formación y desarrollador por pasión, he hallado mi utopía en el mundo de DevOps y SRE. Poseo más de 12 años de experiencia trabajando en el sector de Tecnologías de la Información, experiencias adquiridas en dos continentes y tres países distintos. En mi trabajo diario, me dedico a ayudar a las empresas a resolver sus problemas en la nube y a orientarlas en la compleja selva de las tecnologías modernas.\nDesde su nacimiento, Docker captó mi total atención, fascinándome su simplicidad y eficacia a la hora de implementar y desplegar servicios en el entorno actual. Considero a Kubernetes como la evolución y transformación natural en este campo.\nEn la actualidad, me desempeño como CEO de [CCSolutions.io](http://ccsolutions.io/) y [CCSTech.io](http://ccstech.io/), donde nuestra visión es asistir a las empresas en su transformación digital aprovechando el poder del código en la nube. Como apasionado del Python, estoy seguro de que podemos afrontar cualquier reto que se nos presente en este emocionante viaje hacia el futuro digital.",
  "shortDescription": null,
  "group": {
    "id": "16514622",
    "name": "Python Valencia"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "26105137",
    "name": "Wayco",
    "address": "Carrer de l'Almirall Cadarso, 26",
    "city": "València",
    "postalCode": "46005",
    "lng": 0,
    "lat": 0
  },
  "onlineVenue": null,
  "dateTime": "2023-06-29T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-06-29T21:00+02:00"
}