{
  "id": "299136811",
  "title": "Debian: una comunidad para todos, más allá de la tecnología",
  "eventUrl": "https://www.meetup.com/python-valencia-meetup/events/299136811",
  "description": "La comunidad Debian es una de las comunidades de software libre más grandes y activas del mundo. Con más de 1200 miembros activos y colaboradores de todo el planeta, Debian se encarga de desarrollar y mantener la distribución GNU/Linux Debian, una de las más populares y estables del mercado.\nEn esta charla, exploraremos la organización y estructura de la comunidad Debian. Descubriremos cómo se toman las decisiones, cómo se organiza el trabajo y cómo se resuelven los conflictos. También conoceremos los diferentes roles y equipos que existen dentro de la comunidad, y las diversas formas en que puedes participar.\n\n## Breve resumen de trayectoria laboral\n\nMi pasión por la tecnología me llevó a estudiar Ingeniería de Telecomunicaciones con especialidad en electrónica. Comencé mi carrera desarrollando hardware para sistemas de bloqueo de trenes via satélite, y en mi tiempo libre exploraba el mundo de los microcontroladores y FPGA.\nEn 2005, me uní a Emdebian, empaquetando utilidades para el desarrollo de sistemas embebidos. Esta experiencia me abrió las puertas a una comunidad apasionada por el software libre. Mi compromiso con Debian creció con el tiempo. Organicé talleres, me uní al equipo de administradores de la infrastructura de Debian, ayude en la organizacion de la conferencia anual de Debian, adquiri compromisos como tesorero de la organización, etc.En resumen, mi trayectoria profesional ha estado marcada por la pasión por la tecnología y el compromiso con el software libre. A través de mi participación en Debian, he tenido la oportunidad de aprender, colaborar y contribuir a un proyecto global que beneficia a miles de personas y empresas alrededor del mundo.",
  "shortDescription": null,
  "group": {
    "id": "16514622",
    "name": "Python Valencia"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27591803",
    "name": "wayCO Cabanyal | Coworking València",
    "address": "Carrer de Marià Cuber, 17",
    "city": "València",
    "postalCode": "46011",
    "lng": -0.334373,
    "lat": 39.464138
  },
  "onlineVenue": null,
  "dateTime": "2024-02-27T18:30+01:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-02-27T20:30+01:00"
}