{
  "id": "296794509",
  "title": "4º MeetUp de PyData Granada (solo presencial)",
  "eventUrl": "https://www.meetup.com/pydatagrx/events/296794509",
  "description": "Tras el descanso veraniego y la vuelta al cole, ¡PyData Granada se enorgullece de anunciar su cuarto MeetUp!\n\n¿Qué es PyData? PyData es una comunidad diversa de personas interesadas en el uso y desarrollo de herramientas de análisis de datos con el objetivo de compartir ideas y aprender. Nos reunimos para discutir las mejores prácticas, nuevos enfoques y tecnologías emergentes para la gestión de datos, procesamiento, análisis y visualización. Utilizamos muchos lenguajes de programación, incluyendo (pero no limitado a) Python, Julia y R.\n\n**== AGENDA ==**\n\n**7:00pm** \\- Apertura de puertas y networking\n\n**7:05pm** \\- Breve presentación de PyData Granada y bienvenida de nuestro patrocinador ELCA\n\n**7:15pm** **\\- Cómo hacer un Feature Store desde cero**\n\nAdéntrate en el apasionante mundo de la creación de productos basados en Inteligencia Artificial. Optimiza el tiempo de desarrollo de tus equipos de Data Scientists. Minimiza la puesta en producción de tus modelos predictivos creando herramientas transversales entre proyectos. Madura tu ecosistema de paquetes reutilizables. En esta charla obtendrás las pautas necesarias para desarrollar uno de los componentes principales de la Ingeniería del Aprendizaje Automático, el Feature Store o Almacén de Características. Transforma tus variables en un producto de consumo interno y externo fácilmente accesible.\n\n**Ponente**: Ernesto Martinez del Pino\n**Bio**: Ernesto Martínez del Pino lidera el equipo de Machine Learning Engineering de Syngenta Global. Es CTO y cofounder de Omniaintel, una startup de AI y Bigdata dedicada a la medición de la calidad del aire. Colabora con la startup financiera Menhir en la creación y diseño de productos. Ha impartido dos años consecutivos las asignaturas de Procesamiento de Datos e Inteligencia Artificial en Máster en Data Strategy & Analytics como profesor adjunto en Miotic. Es especialista en el desarrollo de productos relacionados con medioambiente, meteorología, fraude, banca y real estate. Muestra un gran interés por la creación y participación de nuevas startups.\n\n**7:50pm - Matplotlib vs. Ggplot2**\n¡Prepárate para una batalla épica de visualización de datos entre Matplotlib y ggplot2! Enfrentaremos a estos dos gigantes de la visualización y descubriremos quién gana en flexibilidad y control, y quién se alza con la victoria en elegancia y eficiencia ¡Esta es tu oportunidad para elegir tu bando y aprender cuál de estas bibliotecas liderará tu próxima aventura en visualización de datos!\n\n**Ponente**: Rocio Romero Zaliz\n**Bio**: Rocío Romero Zaliz es docente e investigadora en el Departamento de Ciencias de la Computación e Inteligencia Artificial de la Universidad de Granada. Forma parte del comité de difusión y comunicación del Instituto Andaluz de Investigación en Ciencia de Datos e Inteligencia Computacional (Instituto DaSCI) y es subdirectora de transferencia, docencia e investigación del Centro de Investigación en Tecnologías de la Información y las Comunicaciones (CITIC-UGR). Se especializa en temas interdisciplinares en diversos campos, como la física, las matemáticas, la biología y la medicina. Ademas es divulgadora científica ya que además de dar charlas y participar en eventos como La Noche de los Investigadores, también es co-presentadora del podcast SintonIA (\"La IA en las ondas\") en donde divulga temas relacionados con la IA y la ciencia de datos.\n\n**8:25pm - Networking (patrocinado por ELCA)**\n\n¿Te gustaría hablar en este meetup o en uno futuro? Envíanos tu propuesta a través de nuestras redes sociales.\n\n**Agradecimientos**\n\n* [NumFOCUS](https://numfocus.org/)\n* [Oficina de Software Libre de la Universidad de Granada](https://osl.ugr.es/)\n* [Python España](https://es.python.org/)\n* [ELCA Information Technology](https://www.elca.ch/en)",
  "shortDescription": null,
  "group": {
    "id": "36725854",
    "name": "PyData GRX"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27692533",
    "name": "ELCA Information Technology",
    "address": "Calle Andrés Segovia 53, 3B",
    "city": "Granada",
    "postalCode": "meetup16",
    "lng": -3.594947,
    "lat": 37.158875
  },
  "onlineVenue": null,
  "dateTime": "2023-11-16T19:00+01:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-11-16T21:00+01:00"
}