{
  "id": "293781212",
  "title": "3er MeetUp de PyData Granada (solo presencial)",
  "eventUrl": "https://www.meetup.com/pydatagrx/events/293781212",
  "description": "¡PyData Granada se enorgullece de anunciar su primer MeetUp!\n\n¿Qué es PyData? PyData es una comunidad diversa de personas interesadas en el uso y desarrollo de herramientas de análisis de datos con el objetivo de compartir ideas y aprender. Nos reunimos para discutir las mejores prácticas, nuevos enfoques y tecnologías emergentes para la gestión de datos, procesamiento, análisis y visualización. Utilizamos muchos lenguajes de programación, incluyendo (pero no limitado a) Python, Julia y R.\n\n### AGENDA\n\n**7:00pm** \\- Apertura de puertas y networking\n\n**7:05pm** \\- Breve presentación de PyData Granada\nNoticias e información sobre la comunidad.\n\n**7:15pm** - ***Clasificación basada en datos.***\n\nLas técnicas de clasificación nos permiten obtener particiones de elementos para segmentar poblaciones de forma que se pueden establecer grupos de individuos con características comunes entre ellos y que a su vez sean diferentes de los elementos de otros grupos. Encontrar agrupaciones basándonos en datos es un tema que ha sido abordado mediante las técnicas estadísticas de análisis multivariante, concretamente las llamadas técnicas de análisis cluster, que se desarrollaron el siglo pasado. La facilidad con que hoy en día se obtienen, almacenan y analizan datos hace que se utilicen este tipo de técnicas en multitud de ocasiones, frecuentemente sin entender del todo cuáles son las normas por las que se rigen. En esta charla, la ponente explicará los fundamentos de las técnicas de análisis cluster más habituales y cómo funcionan.\n\n**Ponente**: Nuria Rico Castro\n\n**Bio**: Profesora de Estadística en la Universidad de Granada, ha sido parte de la Oficina de Software Libre y Directora de Secretariado de Datos Abiertos en esta universidad. Participa de forma activa en la promoción de las ciencias y las técnicas así como en la divulgación de la estadísica y la ciencia de datos. Realiza trabajos interdisciplinares de investigación, ocupándose del análisis de datos en áreas tan diversas como la ligüística o la ingeniería química.\n\n**7:50pm** - ***¿Puede la estadística superar a la Inteligencia Artificial?.***\n\nLa detección de anomalías es el proceso de identificar patrones inusuales o anormales en los datos que se desvían del comportamiento esperado. Tiene muchas aplicaciones en diversos ámbitos, como la ciberseguridad, la detección de fraudes, la atención sanitaria y la supervisión industrial. En esta charla, exploraré si la inteligencia artificial (IA) es siempre la mejor opción para la detección de anomalías, o si hay casos en los que los métodos estadísticos tradicionales pueden superar o complementar a la IA. Me centraré en dos métodos que utilizan la reducción de la dimensionalidad para encontrar las características más relevantes de los datos: Principal Component Analysis (PCA), un método lineal que utiliza transformaciones ortogonales, y un Autoencoder, una topología de red neuronal que aprende a comprimir y reconstruir los datos. Compararé los puntos fuertes y débiles de estos métodos y mostraré algunos ejemplos de su rendimiento en conjuntos de datos del mundo real. También discutiré algunos retos y futuras direcciones para la investigación en detección de anomalías.\n\n**Ponente**: Pablo Estévez González\n\n**Bio**: Pablo Estévez González es Ingeniero de Telecomunicaciones y trabaja como Site Reliability Engineer (SRE) en Novatec. Es responsable del desarrollo y mantenimiento de sistemas de software fiables, escalables y seguros. También tiene curiosidad por la inteligencia artificial y sus aplicaciones en diferentes dominios, como la ciberseguridad y la infraestructura.\n\n**20:25pm** \\- Networking\n\n¿Te gustaría hablar en este meetup o en uno futuro? Envíanos tu propuesta a través de nuestras redes sociales.\n\n**Agradecimientos**\n\n* [NumFOCUS](https://numfocus.org/)\n* [Oficina de Software Libre de la Universidad de Granada](https://osl.ugr.es/)\n* [Novatec Software Engineering España](https://www.novatec-gmbh.de/en/location/granada-branch/)\n* [Python España](https://es.python.org/)",
  "shortDescription": null,
  "group": {
    "id": "36725854",
    "name": "PyData GRX"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27584732",
    "name": "P.º de la Bomba, 5",
    "address": "P.º de la Bomba, 5",
    "city": "Granada",
    "postalCode": "18008",
    "lng": 0,
    "lat": 0
  },
  "onlineVenue": null,
  "dateTime": "2023-06-22T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-06-22T21:00+02:00"
}