{
  "id": "297653701",
  "title": "5º MeetUp de PyData Granada - Cell Painting y Eficiencia en la nube",
  "eventUrl": "https://www.meetup.com/pydatagrx/events/297653701",
  "description": "**== AGENDA ==**\n\n**7:00pm** \\- Apertura de puertas y networking\n\n**7:05pm** \\- Breve presentación de PyData Granada y bienvenida de nuestro patrocinador Revvity\n\n**7:15pm** **\\- Análisis datos en Drug Discovery: Cell Painting**\nEn esta charla exploraremos la técnica de Cell Painting, fundamental en biología celular. Utiliza sondas fluorescentes para marcar componentes clave como el núcleo, membrana y proteínas, generando imágenes detalladas de morfología y estructuras internas celulares. La importancia del Cell Painting va más allá de las imágenes, destacando su capacidad para extraer conocimientos. Abordaremos el uso de computación paralela en clústers para el análisis eficiente de grandes conjuntos de datos celulares. En investigación biomédica, esta técnica es valiosa para comprender reacciones celulares ante diversas condiciones. Su potencial prometedor contribuirá al desarrollo de terapias más efectivas y personalizadas en el futuro.\n\n**Ponente**: **Alberto Ramos Álvarez**\n**Bio**: Alberto, licenciado en Ciencias Físicas, se doctoró con premio extraordinario en Santiago de Compostela en la especialidad de materiales cuánticos. Ha participado en experimentos en centros de investigación alrededor del mundo, incluyendo Finlandia y Japón. Trabajó como científico en el ICFO, un centro de excelencia internacional especializado en fotónica situado en Barcelona, contribuyendo al diseño y construcción de un microscopio de resolución temporal a escala de femtosegundos. Actualmente, Alberto aplica su conocimiento como científico de datos en Revvity, una destacada compañía estadounidense enfocada en el sector farmacéutico y la biotecnología.\n\n**7:50pm - Python en la nube: versatilidad y eficiencia**\nEl despliegue de soluciones en la nube es cada vez la opción más elegida por las empresas para confiar el desarrollo de sus proyectos. Si bien existe un amplio abanico de servicios listos para su uso, no siempre se ajustan a los requerimientos necesarios, aumentando como consecuencia los costes y la complejidad de su mantenimiento. En multitud de ocasiones resulta más favorable la programación de soluciones personalizadas para procesos ETL/ELT en las que el conocimiento sobre Python y el cálculo de la eficiencia de un código son totalmente indispensables para proporcionar alternativas de calidad capaces de cumplir sus funciones bajo una inversión temporal y monetaria controlada.\n\n**Ponente**: **Lidia Sánchez Mérida**\n**Bio**: Lidia es Ingeniera Informática especializada en Ciencia de Datos y actualmente trabaja principalmente como Azure Data Engineer en UST dentro del ámbito financiero internacional.\n\n**8:25pm - Networking**\n\n¿Te gustaría hablar en este meetup o en uno futuro? Envíanos tu propuesta a través de nuestras redes sociales.\n\n**Agradecimientos**\n\n* [NumFOCUS](https://numfocus.org/)\n* [Oficina de Software Libre de la Universidad de Granada](https://osl.ugr.es/)\n* [Python España](https://es.python.org/)\n* [Revvity](https://www.revvity.com/)\n\n**Código de conducta**\nLos eventos de PyData Granada se rigen por los códigos de conducta de [NumFocus](https://numfocus.org/code-of-conduct) y de la [Python Software Foundation](https://www.python.org/psf/conduct/).\n\n**¿Qué es PyData?**\nPyData es una comunidad diversa de personas interesadas en el uso y desarrollo de herramientas de análisis de datos con el objetivo de compartir ideas y aprender. Nos reunimos para discutir las mejores prácticas, nuevos enfoques y tecnologías emergentes para la gestión de datos, procesamiento, análisis y visualización. Utilizamos muchos lenguajes de programación, incluyendo (pero no limitado a) Python, Julia y R.\n\n**¡Síguenos en redes!**\n\n* Twitter/X: [@PyDataGRX](https://twitter.com/PyDataGRX)\n* Mastodon: [@PyDataGRX@masto.ai](https://masto.ai/@pydatagrx)\n* LinkedIn: [pydata-grx](https://www.linkedin.com/company/pydata-grx/)",
  "shortDescription": null,
  "group": {
    "id": "36725854",
    "name": "PyData GRX"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27709506",
    "name": "Finanzas & I+D+i",
    "address": "Av. del Conocimiento, 16",
    "city": "Granada",
    "postalCode": "18016",
    "lng": -3.610328,
    "lat": 37.150276
  },
  "onlineVenue": null,
  "dateTime": "2023-12-14T19:00+01:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-12-14T21:00+01:00"
}