{
  "id": "300879864",
  "title": "7º MeetUp de PyData Granada - IA aplicada a optimizar ventas e ingeniería civil",
  "eventUrl": "https://www.meetup.com/pydatagrx/events/300879864",
  "description": "**== 🕒 AGENDA ==**\n**6:15pm** \\- Apertura de puertas y networking\n**6:25pm** \\- Breve presentación de [PyData Granada](https://www.meetup.com/pydatagrx) y bienvenida de nuestro sponsor [Certinia](https://certinia.com/)\n**6:35pm** **\\- Cómo el modelado de datos y el aprendizaje automático optimizan las actividades de ventas para el crecimiento empresarial**\nEn la era del Big Data, las empresas tienen acceso a grandes cantidades de información, pero es la utilización eficaz de estos datos lo que diferencia a las empresas de éxito. Aquí es donde entran en juego el modelado de datos y el aprendizaje automático, que ofrecen potentes herramientas para optimizar las actividades de ventas e impulsar el crecimiento empresarial. Esta charla explora cómo estas técnicas, implementadas utilizando Polars para el modelado de datos y scikit-learn para el aprendizaje automático, pueden revolucionar las estrategias de ventas. Exploraremos la importancia de la calidad de los datos, el modelado eficiente de datos y la aplicación de algoritmos de aprendizaje automático para mejorar el rendimiento de las ventas y lograr un crecimiento sostenible.\n**Ponentes**:\n\n* **José Antonio Ruiz Millán** es Data Engineer del equipo de datos de Certinia.\n* **José Santos Salvador** es Data Engineer del equipo de datos de Certinia.\n\n**7:05pm - El gemelo digital en ingeniería civil**\nLa ingeniería civil se encuentra en una coyuntura crítica del siglo XXI, enfrentando una serie de desafíos y oportunidades que demandan un cambio en las prácticas y metodologías tradicionales. Con numerosas estructuras construidas llegando al final de su vida útil, surge la necesidad imperiosa de implantar soluciones sostenibles y tecnológicamente avanzadas. Con el fin de abordar este desafío, se presenta un marco conceptual integral de gemelo digital, considerando aspectos como el envejecimiento de las infraestructuras y su digitalización, la necesidad de modelos analíticos que funcionen en tiempo real y la escasez de datos para su entrenamiento. Se investigan estrategias para la operación y mantenimiento, así como la adopción cohesionada de tecnologías digitales, como el Modelado de Información de Construcción (BIM), el Internet de las Cosas (IoT) y la Inteligencia Artificial (IA), empleando modelos de deep learning tanto generativos (conditional WGAN-GP) como predictivos (regresores y clasificadores basados en CNNs).\n**Ponente**:\n\n* **María Megía Cardeñoso** es ingeniera de caminos, canales y puertos por la Universidad de Granada, con 20 años de experiencia en obra civil y proyectos en España y América, y 5 años en ciencia de datos y machine learning. Consultora para la UE en los programas H2020 y Horizonte Europa, es especialista en I+D+i y recién doctorada en la tecnología del gemelo digital. [LinkedIn](www.linkedin.com/in/maria-megia-cardenoso).\n\n**7:35pm - Networking**\n¿Te gustaría hablar en este meetup o en uno futuro? Envíanos tu propuesta a través de nuestras redes sociales.\n\n**🙏 Agradecimientos**\n\n* [NumFOCUS](https://numfocus.org/)\n* [Oficina de Software Libre de la Universidad de Granada](https://osl.ugr.es/)\n* [Python España](https://es.python.org/)\n* [Certinia](https://certinia.com/)\n\n**🎭 Código de conducta**\nLos eventos de PyData Granada se rigen por los códigos de conducta de [NumFocus](https://numfocus.org/code-of-conduct) y de la [Python Software Foundation](https://www.python.org/psf/conduct/).\n\n**✨ ¿Qué es PyData?**\nPyData es una comunidad diversa de personas interesadas en el uso y desarrollo de herramientas de análisis de datos con el objetivo de compartir ideas y aprender. Nos reunimos para discutir las mejores prácticas, nuevos enfoques y tecnologías emergentes para la gestión de datos, procesamiento, análisis y visualización. Utilizamos muchos lenguajes de programación, incluyendo (pero no limitado a) Python, Julia y R.\n\n**▶ ¡Síguenos en redes!**\n\n* Twitter/X: [@PyDataGRX](https://twitter.com/PyDataGRX)\n* Mastodon: [@PyDataGRX@masto.ai](https://masto.ai/@pydatagrx)\n* LinkedIn: [pydata-grx](https://www.linkedin.com/company/pydata-grx/)",
  "shortDescription": null,
  "group": {
    "id": "36725854",
    "name": "PyData GRX"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27807790",
    "name": "Certinia",
    "address": "Av. San Rafael, 1",
    "city": "Armilla",
    "postalCode": "18100",
    "lng": -3.616573,
    "lat": 37.15368
  },
  "onlineVenue": null,
  "dateTime": "2024-05-23T18:15+02:00",
  "duration": "PT2H45M",
  "timezone": "Europe/Madrid",
  "endTime": "2024-05-23T21:00+02:00"
}