{
  "id": "298652538",
  "title": "6º MeetUp de PyData Granada: IA Generativas + Clasificación de imágenes médicas",
  "eventUrl": "https://www.meetup.com/pydatagrx/events/298652538",
  "description": "**== AGENDA ==**\n\n**6:30pm** \\- Apertura de puertas y networking\n\n**6:35pm** \\- Breve presentación de PyData Granada y bienvenida de nuestro patrocinador Unit4\n\n**6:45pm** **\\- RAG: Adopción/Integración de la IA Generativa en una empresa en la nube**\nExploraremos el revolucionario mundo de Generative AI y cómo puede ser aplicado en el software empresarial. Aprenderás:\n\n* Introducción al novedoso mundo de Gen AI: Una introducción clara y concisa a Generative AI, LLM, ChatGPT.\n* Fundamentos de la técnica RAG (Retrieval-Augmented Generation): Entender qué es y cómo nos ayuda a aprovechar al máximo las capacidades de Generative AI.\n* Aplicación Práctica en Unit4: Casos de estudio reales donde este patrón ha sido implementado exitosamente, resaltando los desafíos, beneficios, y mejores prácticas.\n\n**Ponentes**:\n\n* **Paula Villa Martín** es doctora en Física por la Universidad de Granada. Se unió a la compañía de software Unit4 en 2021 como Data Scientist, donde ayuda en la identificación, desarrollo y despliegue de soluciones de Machine Learning.\n* **Oscar Diez Gómez** es graduado en Matemáticas por la Universidad de Málaga con postgrado en Ciencia de Datos por la Universidad de Granada. Trabaja en la compañía de software Unit4 desde 2021 como Product Manager involucrado en proyectos relacionados con IA y Ciencia de Datos.\n\n**7:15pm - Aprendiendo a clasificar imágenes médicas**\nTodos los métodos que conocemos para clasificar imágenes necesitan grandes cantidades de ejemplos etiquetados; imágenes a las que una o varias personas les han asignado una etiqueta. Si queremos usar estos métodos para diagnosticar enfermedades, necesitamos que los médicos etiqueten imágenes médicas. Sin embargo, el tiempo del que disponen los médicos es muy limitado y caro, por lo que es prácticamente imposible obtener grandes conjuntos de imágenes médicas anotadas manualmente. En esta charla exploraremos cómo podemos resolver este problema usando “paradigmas de etiquetado débil”. Profundizaremos en algunas aplicaciones, como la detección de hemorragias intracraneales o la detección de cáncer.\n\n**Ponente**:\n\n* **Francisco Miguel Castro Macías** (Fran Castro) es graduado en Matemáticas y en Informática por la Universidad de Granada. Tiene un máster en Ciencia de Datos e Ingeniería de Computadores, también por la Universidad de Granada. Desde Julio de 2022 es miembro del grupo de investigación “Visual Information Processing”. Actualmente, es estudiante de doctorado bajo la supervisión de Rafael Molina, Pablo Morales, y Aggelos K. Katsaggelos. Su investigación se centra en el desarrollo de modelos probabilísticos para problemas inversos y débilmente supervisados, con aplicaciones en medicina.\n\n**7:45pm - Networking**\n\n¿Te gustaría hablar en este meetup o en uno futuro? Envíanos tu propuesta a través de nuestras redes sociales.\n\n**Agradecimientos**\n\n* [NumFOCUS](https://numfocus.org/)\n* [Oficina de Software Libre de la Universidad de Granada](https://osl.ugr.es/)\n* [Python España](https://es.python.org/)\n* [Unit4](https://www.unit4.com)\n* [PTS Granada](https://ptsgranada.com/)\n\n**Código de conducta**\nLos eventos de PyData Granada se rigen por los códigos de conducta de [NumFocus](https://numfocus.org/code-of-conduct) y de la [Python Software Foundation](https://www.python.org/psf/conduct/).\n\n**¿Qué es PyData?**\nPyData es una comunidad diversa de personas interesadas en el uso y desarrollo de herramientas de análisis de datos con el objetivo de compartir ideas y aprender. Nos reunimos para discutir las mejores prácticas, nuevos enfoques y tecnologías emergentes para la gestión de datos, procesamiento, análisis y visualización. Utilizamos muchos lenguajes de programación, incluyendo (pero no limitado a) Python, Julia y R.\n\n**¡Síguenos en redes!**\n\n* Twitter/X: [@PyDataGRX](https://twitter.com/PyDataGRX)\n* Mastodon: [@PyDataGRX@masto.ai](https://masto.ai/@pydatagrx)\n* LinkedIn: [pydata-grx](https://www.linkedin.com/company/pydata-grx/)",
  "shortDescription": null,
  "group": {
    "id": "36725854",
    "name": "PyData GRX"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27734980",
    "name": "Unit4",
    "address": "",
    "city": "Granada",
    "postalCode": "18100",
    "lng": -3.610401,
    "lat": 37.15006
  },
  "onlineVenue": null,
  "dateTime": "2024-02-22T18:30+01:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-02-22T20:30+01:00"
}