{
  "id": "296678892",
  "title": "🗄️ SQL generado con lenguaje natural y MLFlow para productivización de modelos",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/296678892",
  "description": "PyData Madrid vuelve en octubre para hablar de Python, Datos, Visualización, Inteligencia Artificial, ¡y lo que surja!\n\nEl evento se realizará en Torre Cepsa (Pº de la Castellana 259), que generosamente ha cedido su espacio.\n\n***Importante*** *⚠️ Necesitamos tu nombre completo y DNI, no olvides introducirlo en el formulario de registro. Usa el campo \"razón para asistir\" para el DNI.*\n\nEn esta ocasión, tendremos el placer de contar con dos charlas:\n\n* **Carlos Pinuaga Piñuela** y **Luis Rodriguez Lujan** (19:15-19:45), Data Engineer en Cepsa y Data Scientist en Cepsa respectivamente, nos darán la charla \"Text2SQL: Del post de Medium al mundo real\", en la que hablaran de generación de consultas SQL a partir de lenguaje natural como parte de la Democratización del dato (en español).\n* **Ana Luisa Sierra** y **Roger Pou López** (19:15-19:45) Data Scientist en Axactor ASA y Data Scientist respectivamente, nos hablarán de cómo utilizar MLFlow para evitar un desastre total en la productivización de modelos (en español).\n\nDespués de la reunión, haremos *networking* en un bar cercano.\n\nRecomendaciones generales:\n\n* ¿Sabes mucho de Python y Datos? ¿Sabes poco y quieres saber más? ¡En ambos casos, te damos la bienvenida!\n* Aplica \"la regla del comecocos\": si estás en un círculo, deja siempre un hueco para que otra persona se pueda unir.\n* Puede haber asistentes que no hablen bien español y que se manejen mejor en inglés. Sé paciente y ¡no dejes que se aburran!\n* En los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.\n\n\\*\\*\\*\nPyData Madrid comes back in October to talk about Python, Data, Visualization, Artificial Intelligence, and more!\n\nThe event will take place at the Torre Cepsa (Pº de la Castellana 259), who have generously offered their space.\n\n***Important*** *⚠️ We will need your full name and ID, don't forget to type it in the registration form. Use the field \"reason to attend\" for the ID.*\n\nThis time, we will have the pleasure of having these two talks:\n\n* **Carlos Pinuaga Piñuela** y **Luis Rodriguez Lujan** (19:15-19:45), Data Engineer at Cepsa and Data Scientist at Cepsa respectively, will give us the talk \"Text2SQL: From Medium post to the real world\", in which they will talk about generating SQL queries from natural language as part of the Democratization of data (in Spanish).\n* **Ana Luisa Sierra** y **Roger Pou López** (19:15-19:45) Data Scientist at Axactor ASA and Data Scientist respectively, will talk about how to use MLFlow to avoid a total disaster in model productivization (in Spanish).\n\nAfter the meeting, we will go to a nearby bar to do some networking.\n\nGeneral recommendations:\n\n* Are you an expert in Python and Data? Are you a beginner and you want to learn more? In both cases, you are very welcome!\n* Apply the \"Pacman rule\": if you're in a circle, leave a gap so that someone else can join.\n* If you don't speak good Spanish, we will do our best to make you feel comfortable. But be mindful that other attendees might want to use their native language in larger conversations. Use this opportunity to practice your Spanish! If you are bored, feel free approach the organizers and say «Hi!»\n* At PyData events there is a Code of Conduct [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) super short version: be kind (all else is details), abstain from insulting others or making sexist, racist, or other exclusionary jokes, and do absolutely not make sexual advances to other attendees.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27679769",
    "name": "Cepsa",
    "address": "P.º de la Castellana, 259",
    "city": "Madrid",
    "postalCode": "28029",
    "lng": -3.68772,
    "lat": 40.475643
  },
  "onlineVenue": null,
  "dateTime": "2023-10-19T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-10-19T21:00+02:00"
}