{
  "id": "296832658",
  "title": "🎃 Taller: Contribución al open source por Hacktoberfest",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/296832658",
  "description": "Nos vemos en octubre una vez más para seguir hablando de Python, Datos, Visualización, Inteligencia Artificial, ¡y lo que surja!\n\nEste año nos sumamos a las actividades de Hacktoberfest, un evento anual organizado por DigitalOcean para promover el código abierto, con un taller de contribución al open source.\n\nNos enfocaremos en pandas, scikit-learn, y SciPy, pero todos los proyectos son bienvenidos. ¡No olvides traer tu portátil bien cargado!\n\nEl evento se hará en The Bridge (paseo de Recoletos 15), que generosamente ha cedido su espacio.\n\nEste será el esquema del evento:\n\n* **Introducción** (18:00-18:15) Presentaremos PyData Madrid, explicaremos la mecánica del taller, y dividiremos a la gente en grupos.\n* **Hacking** (18:15-20:30) Cada grupo empezará a trabajar en las tareas asignadas y empezará a mandar pull requests.\n* **Presentaciones y cierre** (20:30-21:00) Haremos una ronda para ver qué consiguió cada grupo y cerraremos el taller.\n\nPara facilitar las contribuciones recomendamos utilizar Gitpod https://gitpod.io/, un entorno de desarrollo colaborativo en la nube compatible con VSCode.\n\nLos únicos requisitos previos son saber Python, un poco de git, tener cuenta en GitHub, y buena actitud. Algunas tareas serán más difíciles que otras y el éxito no está garantizado, pero ¡esperamos que todo el mundo disfrute!\n\nDespués del evento nos iremos a tomar algo a un bar cercano.\n\nRecomendaciones generales:\n\n* ¿Sabes mucho de Python y Datos? ¿Sabes poco y quieres saber más? ¡En ambos casos, te damos la bienvenida!\n* Aplica \"la regla del comecocos\": si estás en un círculo, deja siempre un hueco para que otra persona se pueda unir.\n* Puede haber asistentes que no hablen bien español y que se manejen mejor en inglés. Sé paciente y ¡no dejes que se aburran!\n* En los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "26842039",
    "name": "The Bridge | Digital Talent Accelerator",
    "address": "P.º de Recoletos, 15",
    "city": "Madrid",
    "postalCode": "28004",
    "lng": -3.692671,
    "lat": 40.42151
  },
  "onlineVenue": null,
  "dateTime": "2023-10-25T18:00+02:00",
  "duration": "PT3H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-10-25T21:00+02:00"
}