{
  "id": "294138513",
  "title": "🪐 Mercury, la librería de Data Science de BBVA y defensa planetaria",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/294138513",
  "description": "PyData Madrid vuelve en junio para hablar de Python, Datos, Visualización, Inteligencia Artificial, ¡y lo que surja!\n\nEl evento se realizará en las oficinas de [BBVA AI Factory](http://www.bbvaaifactory.com/) (Avenida de Manoteras 44, planta 3, Las Tablas), que generosamente ha cedido su espacio.\n\n***Importante*** *⚠️ Necesitamos tu nombre completo y DNI, no olvides introducirlo en el formulario de registro. Usa el campo \"razón para asistir\" para el DNI.*\n\nEn esta ocasión, tendremos el placer de contar con dos charlas:\n\n* **Álvaro Ibraín** (19:15-19:45), Data Scientist en BBVA AI Factory, nos hablará sobre cómo escalaron internamente el uso de Mercury, la librería de Data Science de BBVA, y nos presentará algunos componentes liberados para toda la comunidad (en español).\n* **Miguel Benayas** (19:45-20:15), Lead Data Scientist en RENFE, hablará sobre técnicas de Machine Learning para clasificación de trayectorias de asteroides que desarrolló durante su período en el equipo de Defensa Planetaria de la NASA (en español).\n\nDespués de la reunión, haremos *networking* en las oficinas de BBVA AI Factory, que pondrá pizzas y bebidas.\n\nRecomendaciones generales:\n\n* ¿Sabes mucho de Python y Datos? ¿Sabes poco y quieres saber más? ¡En ambos casos, te damos la bienvenida!\n* Aplica \"la regla del comecocos\": si estás en un círculo, deja siempre un hueco para que otra persona se pueda unir.\n* Puede haber asistentes que no hablen bien español y que se manejen mejor en inglés. Sé paciente y ¡no dejes que se aburran!\n* En los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.\n\n\\*\\*\\*\nPyData Madrid comes back in May to talk about Python, Data, Visualization, Artificial Intelligence, and more!\n\nThe event will take place at the BBVA AI Factory offices (Avenida de Manoteras 44, planta 3, Las Tablas), who have generously offered their space.\n\n***Important*** *⚠️ We will need your full name and ID, don't forget to type it in the registration form. Use the field \"reason to attend\" for the ID.*\n\nThis time, we will have the pleasure of having these two talks:\n\n* **Álvaro Ibraín** (19:15-19:45), Data Scientist at BBVA AI Factory, will tell us about how they scaled internally the use of Mercury, BBVA's Data Science library, and will present some components released for the community (in Spanish).\n* **Miguel Benayas** (19:45-20:15), Lead Data Scientist at RENFE, will talk about Machine Learning techniques for asteroid trajectory classification that he developed during his period at Planetary Defense at NASA (in Spanish).\n\nAfter the meeting, we will stay at BBVA AI Factory offices to do some networking with pizzas and drinks.\n\nGeneral recommendations:\n\n* Are you an expert in Python and Data? Are you a beginner and you want to learn more? In both cases, you are very welcome!\n* Apply the \"Pacman rule\": if you're in a circle, leave a gap so that someone else can join.\n* If you don't speak good Spanish, we will do our best to make you feel comfortable. But be mindful that other attendees might want to use their native language in larger conversations. Use this opportunity to practice your Spanish! If you are bored, feel free approach the organizers and say «Hi!»\n* At PyData events there is a Code of Conduct [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) super short version: be kind (all else is details), abstain from insulting others or making sexist, racist, or other exclusionary jokes, and do absolutely not make sexual advances to other attendees.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27597721",
    "name": "BBVA AI Factory",
    "address": "Av. de Manoteras, 44",
    "city": "Madrid",
    "postalCode": "28050",
    "lng": -3.664584,
    "lat": 40.487144
  },
  "onlineVenue": null,
  "dateTime": "2023-06-22T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2023-06-22T21:00+02:00"
}