{
  "id": "301892826",
  "title": "☀️ Tour de BigFrames y fiesta fin de curso",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/301892826",
  "description": "PyData Madrid vuelve en julio a celebrar la última reunión de la temporada para hablar de Python, Datos, Visualización, Inteligencia Artificial, ¡y lo que surja!\n\nEn esta ocasión nos reuniremos en las oficinas de MásOrange (Palos de la Frontera 12), quienes generosamente han cedido su espacio.\n\nTendremos el placer de contar con una charla y algunas sorpresas:\n\n* **Diego Vicente** (19:15-19:45), *Data Scientist en Carto* hablará de BigFrames, que ofrece una interfaz compatible con pandas para conectar con BigQuery (en español).\n* *Charlas rápidas de fin de curso ✨* ¡Más detalles pronto!\n\nAl terminar, nos quedaremos tomando algo en las oficinas de MásOrange y haciendo networking.\n\n**Recomendaciones generales:**\n\n* ¿Sabes mucho de Python y Datos? ¿Sabes poco y quieres saber más? ¡En ambos casos, te damos la bienvenida!\n* Aplica \"la regla del comecocos\": si estás en un círculo, deja siempre un hueco para que otra persona se pueda unir.\n* Puede haber asistentes que no hablen bien español y que se manejen mejor en inglés. Sé paciente y ¡no dejes que se aburran!\n* En los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.\n\n\\*\\*\\*\nPyData Madrid comes back in July for the last event of the season to talk about Python, Data, Visualization, Artificial Intelligence, and more!\n\nThis time we will meet at the MásOrange offices (Palos de la Frontera 12).\n\nThis time, we will have the pleasure of having these two talks:\n\n* **Diego Vicente** (19:15-19:45), *Data Scientist at Carto*, will talk about BigFrames, a library offering a pandas-compatible API to connect with BigQuery (in Spanish).\n* *End of season lightning talks* ✨ more details soon!\n\nAfter the event we will stay at the MásOrange offices doing some networking over drinks.\n\nGeneral recommendations:\n\n* Are you an expert in Python and Data? Are you a beginner and you want to learn more? In both cases, you are very welcome!\n* Apply the \"Pacman rule\": if you're in a circle, leave a gap so that someone else can join.\n* If you don't speak good Spanish, we will do our best to make you feel comfortable. But be mindful that other attendees might want to use their native language in larger conversations. Use this opportunity to practice your Spanish! If you are bored, feel free approach the organizers and say «Hi!»\n* At PyData events there is a Code of Conduct [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) super short version: be kind (all else is details), abstain from insulting others or making sexist, racist, or other exclusionary jokes, and do absolutely not make sexual advances to other attendees.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "HYBRID",
  "venue": {
    "id": "27841183",
    "name": "MásOrange",
    "address": "Palos de la Frontera 12",
    "city": "Madrid",
    "postalCode": "meetup1",
    "lng": -3.699457,
    "lat": 40.4028
  },
  "onlineVenue": null,
  "dateTime": "2024-07-04T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-07-04T21:00+02:00"
}