{
  "id": "303470661",
  "title": "🎃 Hacktoberfest: taller de contribución a proyectos open source",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/303470661",
  "description": "Un año más, ¡PyData Madrid participa en **Hacktoberfest**!\n\nHacktoberfest es un evento anual que se celebra durante el mes de octubre orientado a promover la colaboración en proyectos open source.\n\nDurante este mes, desarrolladores de todo el mundo se unen para añadir nuevas funcionalidades, corregir errores o mejorar la documentación de proyectos de código abierto. Es una oportunidad fantástica para involucrarte en la comunidad open source, aprender, desarrollar tus habilidades y divertirte, incluso hay premios para aquellos que hagan varias contribuciones.\n\n**¿Quién puede participar en Hacktoberfest?**\n\n¡Cualquiera! Uno de los principios de Hacktoberfest es que todo el mundo es bienvenido. Para nuestro taller hay algunos requisitos:\n\n* Cuenta en GitHub\n* Conocimientos de Python (algunas tareas serán más difíciles que otras)\n* Conocimientos de Git\n* Tener ganas de participar y buena actitud (a veces contribuir no será fácil)\n\nPuedes utilizar el IDE que te resulte más cómodo o usar [Gitpod](https://gitpod.io), un entorno de desarrollo colaborativo en la nube compatible con VS Code.\n\nPor último, ¡no olvides traer tu portátil bien cargado!.\n\n**¿En qué consiste este evento?**\n\nEl taller se llevará a cabo de 18:00 a 21:00 en las instalaciones de **Datais** (c/ María de Molina, 39), que generosamente ha cedido su espacio.\n\nAl arrancar daremos algunos trucos básicos y nos repartiremos en grupos para contribuir a diferentes proyectos. *La lista final de proyectos aún está en progreso*.\n\nEl año pasado conseguimos hacer 4 pull requests a SciPy, scikit-learn, y pandas. ¿Cuántas podremos hacer este año?\n\n**Programa del taller:**\n\n* **Introducción** (18:00-18:15): presentaremos PyData Madrid, explicaremos la mecánica del taller y formaremos equipos de trabajo.\n* ***Hacking*** (18:15-20:30): durante este tiempo contaremos con mentores que os ayudarán para que podáis mandar pull requests.\n* **Cierre** (20:30-21:00): haremos una ronda para comentar nuestros avances y cerraremos el taller. *Incluye charla sorpresa*.\n\nAl acabar, iremos a tomar algo a un bar cercano.\n\nRecuerda que en los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "27888742",
    "name": "Datais",
    "address": "C/Maria de Molina, 39",
    "city": "Madrid",
    "postalCode": "meetup1",
    "lng": -3.680033,
    "lat": 40.437744
  },
  "onlineVenue": null,
  "dateTime": "2024-10-09T18:00+02:00",
  "duration": "PT3H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-10-09T21:00+02:00"
}