{
  "id": "303349697",
  "title": "✨ Orquestación con Airflow y aprendiendo cualquier tecnología en segundos",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/303349697",
  "description": "PyData Madrid vuelve en septiembre para hablar de Python, Datos, Visualización, Inteligencia Artificial, ¡y lo que surja!\n\nEste mes el evento se realizará en las oficinas de Cabify (calle Pradillo 42), que generosamente ha cedido su espacio.\n\nTendremos el placer de contar con dos charlas:\n\n* **Fiorella Piriz** (19:15-19:45), Solution Architect en Amazon Web Services, hablará sobre Apache Airflow, una popular solución para orquestación de flujos de datos basada en Python (en español).\n* **Jose Mussach** (20:00-20:30), Consultor Senior en la Comunidad de Madrid, nos contará cómo hace para ponerse al día en cualquier tecnología en cuestión de segundos con Python (en español).\n\nDespués de la reunión, nos quedaremos haciendo *networking* en las instalaciones de Cabify.\n\n**Recomendaciones generales:**\n\n* ¿Sabes mucho de Python y Datos? ¿Sabes poco y quieres saber más? ¡En ambos casos, te damos la bienvenida!\n* Aplica \"la regla del comecocos\": si estás en un círculo, deja siempre un hueco para que otra persona se pueda unir.\n* Puede haber asistentes que no hablen bien español y que se manejen mejor en inglés. Sé paciente y ¡no dejes que se aburran!\n* En los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.\n\n\\*\\*\\*\n\nPyData Madrid comes back in September to talk about Python, Data, Visualization, Artificial Intelligence, and more!\n\nThe event will take place at Cabify (Pradillo, 42).\n\nThis time, we will have the pleasure of having these two talks:\n\n* **Fiorella Piriz** (19:15-19:45), Solution Architect en Amazon Web Services, will talk about Apache Airflow, a popular open source solution for data orchestration written in Python (in Spanish).\n* **Jose Mussach** (20:00-20:30), Senior Consultant at Comunidad de Madrid, will tell us how he catches up with any technology in seconds using Python (in Spanish).\n\nAfter the meeting, we will stay at Cabify to do some networking.\n\nGeneral recommendations:\n\n* Are you an expert in Python and Data? Are you a beginner and you want to learn more? In both cases, you are very welcome!\n* Apply the \"Pacman rule\": if you're in a circle, leave a gap so that someone else can join.\n* If you don't speak good Spanish, we will do our best to make you feel comfortable. But be mindful that other attendees might want to use their native language in larger conversations. Use this opportunity to practice your Spanish! If you are bored, feel free approach the organizers and say «Hi!»\n* At PyData events there is a Code of Conduct [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) super short version: be kind (all else is details), abstain from insulting others or making sexist, racist, or other exclusionary jokes, and do absolutely not make sexual advances to other attendees.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "PHYSICAL",
  "venue": {
    "id": "25501240",
    "name": "Cabify",
    "address": "Calle de Pradillo, 42, 28002",
    "city": "Madrid",
    "postalCode": "",
    "lng": -3.670841,
    "lat": 40.448925
  },
  "onlineVenue": null,
  "dateTime": "2024-09-19T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-09-19T21:00+02:00"
}