{
  "id": "301014940",
  "title": "☁️ Machine Learning desde Google Cloud y Mitigando alucinaciones con Neo4j",
  "eventUrl": "https://www.meetup.com/pydata-madrid/events/301014940",
  "description": "PyData Madrid vuelve en mayo para hablar de Python, Datos, Visualización, Inteligencia Artificial, ¡y lo que surja!\n\nEl evento se realizará en las oficinas de Making Science (López de Hoyos, 135), que generosamente ha cedido su espacio.\n\nTendremos el placer de contar con dos charlas:\n\n* **Julio Prado** (19:15-19:45), *Senior Data Scientist en Making Science* nos trae una sesión práctica sobre creación e implementación de modelos de ML con la herramientas de Google Cloud (BigQueryML, VertexAI) (en español).\n* **Luis Salvador** (20:00-20:30), *Senior Presales en Neo4j* trae una breve introducción a bases de datos de grafos y su uso con la LLM de OpenAI para obtener respuestas más exactas centradas en el dominio de la aplicación (en español).\n\nDespués de la reunión, nos quedaremos haciendo *networking* en las instalaciones de Making Science.\n\n**Recomendaciones generales:**\n\n* ¿Sabes mucho de Python y Datos? ¿Sabes poco y quieres saber más? ¡En ambos casos, te damos la bienvenida!\n* Aplica \"la regla del comecocos\": si estás en un círculo, deja siempre un hueco para que otra persona se pueda unir.\n* Puede haber asistentes que no hablen bien español y que se manejen mejor en inglés. Sé paciente y ¡no dejes que se aburran!\n* En los eventos PyData rige un Código de Conducta [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) el resumen traducido: sé amable, abstente de insultar y de hacer bromas sexistas, racistas, o excluyentes en general, y nada de insinuaciones sexuales a otras personas.\n\n\\*\\*\\*\nPyData Madrid comes back in may to talk about Python, Data, Visualization, Artificial Intelligence, and more!\n\nThe event will take place at Making Science (López de Hoyos, 135).\n\nThis time, we will have the pleasure of having these two talks:\n\n* **Julio Prado** (19:15-19:45), Senior Data Scientist at Making Science will bring us a hands-on session on creating and implementing ML models with Google Cloud tools (BigQueryML, VertexAI) (in spanish).\n* **Luis Salvador** (20:00-20:30), Senior Presales at Neo4j will give a brief introduction to graph databases and their use with OpenAI's LLM to get more accurate answers focused on the application domain (in spanish).\n\nAfter the meeting, we will stay at Making Science to do some networking.\n\nGeneral recommendations:\n\n* Are you an expert in Python and Data? Are you a beginner and you want to learn more? In both cases, you are very welcome!\n* Apply the \"Pacman rule\": if you're in a circle, leave a gap so that someone else can join.\n* If you don't speak good Spanish, we will do our best to make you feel comfortable. But be mindful that other attendees might want to use their native language in larger conversations. Use this opportunity to practice your Spanish! If you are bored, feel free approach the organizers and say «Hi!»\n* At PyData events there is a Code of Conduct [https://pydata.org/code-of-conduct/](https://pydata.org/code-of-conduct/) super short version: be kind (all else is details), abstain from insulting others or making sexist, racist, or other exclusionary jokes, and do absolutely not make sexual advances to other attendees.",
  "shortDescription": null,
  "group": {
    "id": "23965442",
    "name": "PyData Madrid"
  },
  "isNetworkEvent": false,
  "isOnline": false,
  "eventType": "HYBRID",
  "venue": {
    "id": "26317402",
    "name": "Making Science",
    "address": "C. de López de Hoyos, 135",
    "city": "Madrid",
    "postalCode": "28002",
    "lng": -3.669883,
    "lat": 40.447197
  },
  "onlineVenue": null,
  "dateTime": "2024-05-29T19:00+02:00",
  "duration": "PT2H",
  "timezone": "Europe/Madrid",
  "endTime": "2024-05-29T21:00+02:00"
}